<template>
  <section class="day">
    <h1>День 1</h1>
    <p>Самый большой риск связан с тем, что ты бросишь идею работать над сном, так и не ощутив ценности. Поэтому сегодня наша задача — научиться не забывать о курсе и начать постепенно вырабатывать режим. Для этого давай установим 2 будильника: основной и предупреждающий. </p>
    <ul>
      <li>
        Основной будильник стоит установить за 1 час до сна. Он будет означать, что пора заканчивать дела, начать замедляться и плавно готовиться ко сну.
      </li>
      <li>
        Предупреждающий будильник не менее важен — с его помощью основной не будет заставать тебя врасплох, и ты сможешь дисциплинированно на него отреагировать. Давай установим его за 15-20 минут до основного. Этого времени обычно хватает, чтобы спокойно завершить текущую задачу. Если думаешь что нужно больше, можешь взять запас 30-45 минут. Самое главное — с самого начала выработать привычку дисциплинированно реагировать на основной. Сейчас объясню почему.
      </li>
    </ul>
    <h1>Будильник, который не дает второго шанса</h1>
    <p>
      Пропускать основной будильник — это скользкая дорожка. Сделав так несколько раз, ты потеряешь «уважение» к нему, и начнешь выключать его уже «на автомате», даже не задумываясь.

      ️Именно поэтому важно сразу отнестись к нему серьезно.

      А чтобы было проще привыкнуть, у меня для тебя припасён отличный лайфхак:

      Начни с самого простого действия — после звонка будильника отрывайся от дел буквально на 30 секунд. За это время встань, пройдись, сделай несколько глубоких вдохов и попробуй подумать, действительно ли то, чем ты сейчас занимаешься, нельзя отложить до завтра? Только честно

      Поверь, это того стоит. Если следовать нашему намеченном плану в течение этих 30 дней, то за счет возросшей энергии и продуктивности можно будет кратно окупить затраченное время.
    </p>
    <h1>Как выбрать время для отхода ко сну</h1>
    <p>
      Эффективнее спать в темное время суток, потому что свет влияет на твои циркадные ритмы и выработку важного гормона мелатонина. Мы потом в курсе это разберем очень подробно.

      Но также для здоровья и продуктивности не менее важно, чтобы выбранный режим не сбивался. Лучше даже регулярно ложиться в 01:00, чем каждый день по-разному.

      Если в данный момент режим сбит, и ты ложишься позже 00:00, то не стоит пытаться резко перестроиться — это будет стрессом для организма. Лучше выбери комфортное для себя время, в которое уже будешь хотеть спать.
    </p>
    <h1>
      Что делать после?
    </h1>
    <p>
      После звонка основного будильника, в первую очередь нужно отложить дела, которые приводят к стрессу или перевозбуждению: работу, тренировки, споры, жаркие соревновательные игры — всё это лучше оставить на следующий день.

      Чем тогда заняться в этот час?

      Можно посвятить это время любым приятным делам, которые не возбуждают, а наоборот успокаивают. В течение этого месяца мы постепенно будем строить вечерний ритуал, заполняя этот час приятными и полезными привычками.

      Ну и, конечно, после второго будильника приходи ко мне, мы продолжим наше приключение в мир сна.
    </p>
    <div class="d-flex justify-center">
      <v-btn @click="taskDialog = true" class="mx-auto mt-6">Перейти к заданию</v-btn>
    </div>
    <v-dialog max-width="700" v-model="taskDialog">
      <v-card>
        <v-card-title>Задание на сегодня</v-card-title>
        <v-card-text class="mx-6">
          <ol>
            <li>
              Выбери удобное время отхода ко сну
            </li>
            <li>
              Установи 2 будильника, как описано выше. Выбери самую приятную мелодию — сразу начнем формировать положительное восприятие вечернего ритуала. Чуть позже я расскажу, почему это важно.
            </li>
            <li>
              Приступай завтра к следующему заданию после того, как сработает основной будильник
            </li>
          </ol>
          <p>Это важно, потом в курсе будет многое завязано на эти будильники.</p>
        </v-card-text>
        <v-card-actions class="d-flex justify-end">
          <v-btn @click="taskDialog = false; surveyDialog = true">Прочитано</v-btn>
        </v-card-actions>
      </v-card>
    </v-dialog>
    <v-dialog v-model="surveyDialog" max-width="750">
      <v-card>
        <Survey/>
      </v-card>
    </v-dialog>
  </section>
</template>

<script setup lang="ts">
const taskDialog = ref(false);
const surveyDialog = ref(false);
</script>

<style
    scoped
    lang="scss"
>
@import '../../assets/styles/style';
@import '../../assets/styles/colors';

ol, ul {
  margin-left: 16px;
}

h1 {
  margin-top: 20px;
}

.day {
  line-height: 2;
  margin: 20px 100px;
}
</style>